{
  "diagnosa": [
    {
      "id": 1,
      "nama": "Caries",
      "penyebab": "Karies gigi terjadi ketika bakteri pada gigi menumpuk dan menimbulkan pembentukan plak, sehingga menyebabkan demineralisasi atau hilangnya komposisi mineral.",
      "rekomendasi": "Perawatan karies gigi bisa dilakukan dengan prosedur tambal gigi di dokter. Prosedur ini biasanya diterapkan pada kondisi karies gigi yang belum terlalu dalam dan parah. Tujuan tambal gigi adalah menutup karies agar tidak semakin menyebar ke bagian gigi lainnya."
    },
    {
      "id": 2,
      "nama": "Calculus / Karang gigi",
      "penyebab": "Pada dasarnya, kalkulus gigi berawal dari sisa-sisa makanan yang menumpuk di gigi hingga berubah menjadi lapisan tipis dan lengket yang disebut plak. Plak yang tidak dibersihkan dalam waktu lama kemudian berubah menjadi kalkulus gigi.",
      "rekomendasi": "Scaling gigi merupakan tindakan mengikis karang yang menempel di permukaan gigi. Proses ini harus dilakukan oleh tenaga ahli (dokter)."
    },
    {
      "id": 3,
      "nama": "Discoloration",
      "penyebab": "Penyebab discoloration dapat bervariasi, termasuk penuaan gigi, penggunaan bahan kimia atau obat-obatan, serta nekrosis pada pulpa akibat gigi berlubang atau trauma.",
      "rekomendasi": "Diskolorasi pada gigi dapat diperbaiki dengan menggunakan bahan pemutih gigi atau bleaching."
    },
    {
      "id": 4,
      "nama": "Gingivitis",
      "penyebab": "Penyebab utama gingivitis adalah kebersihan mulut yang buruk, menyebabkan penumpukan plak gigi. Jika dibiarkan, plak bisa mengeras dan membentuk karang gigi yang dapat menyebabkan peradangan pada gusi.",
      "rekomendasi": "Rekomendasi untuk gingivitis termasuk scaling, root planing, dan operasi flap."
    },
    {
      "id": 5,
      "nama": "Hypodontia",
      "penyebab": "Hypodontia adalah kelainan genetik yang tidak dapat dicegah. Terkadang, hypodontia terjadi tanpa penyebab yang pasti.",
      "rekomendasi": "Rekomendasi untuk hypodontia termasuk pemasangan kawat gigi, mengatur ulang bentuk gigi, dan menggunakan gigi palsu."
    },
     {
      "id": 6,
      "nama": "Cancer Tongue",
      "penyebab": "Kebiasaan merokok, konsumsi minuman beralkohol, infeksi Human papilomavirus (HPV), kesehatan rongga mulut yang tidak baik, pola makan yang tidak sehat.",
      "rekomendasi": "Operasi, kemoterapi, radioterapi"
    },
    {
      "id": 7,
      "nama": "Fissure Tongue",
      "penyebab": "Belum diketahui pasti, namun ada beberapa faktor yang bisa menyebabkan lidah pecah-pecah, seperti faktor keturunan (genetik), kekurangan asupan zat besi, folat, dan vitamin B12, infeksi jamur, konsumsi makanan pedas atau asam, minuman panas, serta minuman beralkohol, serta sistem kekebalan tubuh yang melemah.",
      "rekomendasi": "Berhenti mengonsumsi minuman beralkohol, mengonsumsi makanan bergizi seimbang, mengurangi konsumsi makanan pedas dan asam, memenuhi kebutuhan cairan tubuh dengan minum air putih minimal 8 gelas tiap harinya."
    },
    {
      "id": 8,
      "nama": "Geographic Tongue",
      "penyebab": "Riwayat alergi, stres emosional, perubahan hormon, terutama pada wanita yang mengonsumsi pil KB, fissured tongue (lidah dengan alur di sepanjang permukaannya), kekurangan vitamin dan mineral seperti zinc, zat besi, asam folat, vitamin B6, serta B12.",
      "rekomendasi": "Umumnya lidah geografis tidak memerlukan perawatan medis, namun bisa melakukan pemeriksaan ke dokter untuk mengurangi rasa sakit atau ketidaknyamanan."
    },
    {
      "id": 9,
      "nama": "Leukoplakia Tongue",
      "penyebab": "Kebiasaan merokok atau mengunyah tembakau, bagian gigi yang tidak rata, misalnya karena patah atau bergesekan dengan lidah maupun dinding mulut, gigi palsu yang tidak terpasang dengan baik, konsumsi minuman beralkohol dalam jangka panjang, peradangan di dalam tubuh.",
      "rekomendasi": "Umumnya leukoplakia sembuh dalam beberapa minggu atau bulan setelah penyebabnya ditangani. Jika belum hilang, sebaiknya segera berkonsultasi dengan dokter untuk mendapatkan solusi yang tepat."
    },
    {
      "id": 10,
      "nama": "Lidah Putih",
      "penyebab": "Mulut kering, bernapas melalui mulut, dehidrasi, makanan bertekstur lunak, kebersihan gigi yang kurang, iritasi akibat gigi yang tajam atau peralatan pembersih gigi, demam, merokok atau mengunyah tembakau, mengonsumsi alkohol berlebihan.",
      "rekomendasi": "Rutin menyikat gigi dengan lembut menggunakan sikat gigi yang lembut, menggunakan pembersih lidah khusus, minum banyak air untuk menghilangkan bakteri dan sisa-sisa makanan yang tersangkut pada lidah."
    }
  ]
}